#include <stdio.h>
int main ()
{
	int i,j,n,t,x,k;
	char ch;
	char a[5][400];
	char b[100];
	scanf("%d",&n);
	t = 4*n - 1;      //先确定数组大小；
	getchar();	for(i=0;i<5;i++){        //确定数组大小之后，将数组全部赋值为‘X’；
		for(j=0;j<t;j++){
			a[i][j]='X';
		}
	}
	for(i=0;i<n;i++){
		b[i] = getchar();    //将输入的数字存入另一个新数组；
	}
	for(i=0;i<n;i++){
		x = i*4;             //观察显示屏数字规律，每个数字都从第4*i列开始
		if(x!=0){
			for(int item=0;item<5;item++){
				a[item][x-1]='.';   //第一个数字之后，每次开始前打印一列‘.’；
			}
		}                    //根据数字形状，将对应位置的“X”变为“.”得到数字形状；
		if(b[i]=='0'){
			a[1][x+1]='.'; a[2][x+1]='.'; a[3][x+1]='.';
		}
		else if(b[i]=='1'){
			for(j=0;j<5;j++){
				for(k=x;k<x+2;k++){
					a[j][k]='.';
				}
			}
		}
		else if(b[i]=='2'){
			a[1][x]='.'; a[1][x+1]='.'; a[3][x+1]='.'; a[3][x+2]='.';
		}
		else if(b[i]=='3'){
			a[1][x]='.'; a[1][x+1]='.'; a[3][x]='.'; a[3][x+1]='.';
		}
		else if(b[i]=='4'){
			a[3][x]='.'; a[3][x+1]='.'; a[4][x]='.'; a[4][x+1]='.'; a[0][x+1]='.'; a[1][x+1]='.';
		}
		else if(b[i]=='5'){
			a[1][x+1]='.'; a[1][x+2]='.'; a[3][x]='.'; a[3][x+1]='.';
		}
		else if(b[i]=='6'){
			a[1][x+1]='.'; a[1][x+2]='.'; a[3][x+1]='.';
		}
		else if(b[i]=='7'){
			for(j=1;j<5;j++){
				for(k=x;k<x+2;k++){
					a[j][k]='.';
				}
			}
		}
		else if(b[i]=='8'){
			a[1][x+1]='.'; a[3][x+1]='.';
		}
		else if(b[i]=='9'){
			a[1][x+1]='.'; a[3][x]='.'; a[3][x+1]='.';
		}
	}
	for(i=0;i<5;i++){                //输出数组
		for(j=0;j<t;j++){
			printf("%c",a[i][j]);
			if(j==t-1){
				printf("\n");
			}
		}
	}
	return 0; 
}
